In [1]:
import pandas as pd
import numpy as np

# Merge, Join and Concatenating

In [2]:
left=pd.DataFrame({
    'key':'K0 K1 K2 K3'.split(),
    'A': 'A0 A1 A2 A3'.split(),
    'B':'B0 B1 B2 B3'.split()
})
right=pd.DataFrame({
    'key':'K0 K1 K2 K4'.split(),
    'C':'C0 C1 C2 C4'.split(),
    'D':'D0 D1 D2 D4'.split()
})

In [3]:
display(left,right)

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K4  C4  D4

## Merge
menggabungkan 2 dataframe berdasarkan **KOLOM** tertentu

In [4]:
pd.merge(left,right,on='key')
# secara default inner
# K3 dan 4 tidak muncul karena hanya ada di salah sati df (3 hanya ada di left, 4 hanya ada di right)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [5]:
left.merge(right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [6]:
pd.merge(left, right, how='left', on='key')
# untuk mengatur cara join, gunakan parameter how
# how=left, berarti left join, maka data akan mengikuti dataframe left
# perhatikan bahwa kolom C dan D memiliki data Nan di baris 3, ini karena dataframe right tidak memiliki data K3

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2   C2   D2
3  K3  A3  B3  NaN  NaN

## Join
menggabungkan 2 dataframe berdasarkan **INDEX**nya

In [7]:
left.set_index('key',inplace=True)
right.set_index('key',inplace=True)

In [8]:
display(left,right)

      A   B
key
K0   A0  B0
K1   A1  B1
K2   A2  B2
K3   A3  B3

      C   D
key
K0   C0  D0
K1   C1  D1
K2   C2  D2
K4   C4  D4

In [9]:
left.join(right) #cara penulisan tidak bisa pd.join(left,right)
# secara default left join

      A   B    C    D
key
K0   A0  B0   C0   D0
K1   A1  B1   C1   D1
K2   A2  B2   C2   D2
K3   A3  B3  NaN  NaN

In [10]:
left.join(right,how='inner') #untuk mengubah cara join pakai parameter how

      A   B   C   D
key
K0   A0  B0  C0  D0
K1   A1  B1  C1  D1
K2   A2  B2  C2  D2

In [16]:
#merge dan join, kalau ada kolom yang namanya sama pada kedua dataframe
left=left.reset_index()
right=right.reset_index()

In [17]:
display(left,right)

   index key   A   B
0      0  K0  A0  B0
1      1  K1  A1  B1
2      2  K2  A2  B2
3      3  K3  A3  B3

   index key   C   D
0      0  K0  C0  D0
1      1  K1  C1  D1
2      2  K2  C2  D2
3      3  K4  C4  D4

In [14]:
left.join(right) #error kalau ada kolom yg namanya sama
# ValueError: columns overlap but no suffix specified: Index(['key'], dtype='object')

In [ ]:
left=left.reset_index()
right=right.reset_index()

In [18]:
left.merge(right,on='key') #kalau pakai merge, kolom dengan nama yg sama, diberi akhiran

   index_x key   A   B  index_y   C   D
0        0  K0  A0  B0        0  C0  D0
1        1  K1  A1  B1        1  C1  D1
2        2  K2  A2  B2        2  C2  D2

## Concatenating
menggabungkan 2 atau lebih dataframe, tanpa berdasarkan key tertentu

In [20]:
df1=pd.DataFrame({
    'A':'A0 A1 A2 A3'.split(),
    'B':'B0 B1 B2 B3'.split(),
    'C':'C0 C1 C2 C3'.split(),
    'D':'D0 D1 D2 D3'.split()
})

df2=pd.DataFrame({
    'A':'A4 A5 A6 A7'.split(),
    'B':'B4 B5 B6 B7'.split(),
    'C':'C4 C5 C6 C7'.split(),
    'D':'D4 D5 D6 D7'.split()
})

df3=pd.DataFrame({
    'A':'A8 A9 A10 A11'.split(),
    'B':'B8 B9 B10 B11'.split(),
    'C':'C8 C9 C10 C11'.split(),
    'D':'D8 D9 D10 D11'.split()
})

In [21]:
display(df1,df2,df3)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [24]:
pd.concat([df1,df2,df3]) #seperti menempelkan beberapa dataframe jadi 1. Perhatikan index
# secara default akan menggabungkan kebawah

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [25]:
pd.concat([df1,df2,df2],axis=1) #digabung ke samping, nama kolom jadi berulang

    A   B   C   D   A   B   C   D   A   B   C   D
0  A0  B0  C0  D0  A4  B4  C4  D4  A4  B4  C4  D4
1  A1  B1  C1  D1  A5  B5  C5  D5  A5  B5  C5  D5
2  A2  B2  C2  D2  A6  B6  C6  D6  A6  B6  C6  D6
3  A3  B3  C3  D3  A7  B7  C7  D7  A7  B7  C7  D7

In [26]:
df2=pd.DataFrame({
    'A':'A4 A5 A6 A7'.split(),
    'B':'B4 B5 B6 B7'.split(),
    'C':'C4 C5 C6 C7'.split(),
    'E':'E4 E5 E6 E7'.split()
}) #hanya df2 yang memiliki kolom E

In [27]:
pd.concat([df1,df2,df3])

     A    B    C    D    E
0   A0   B0   C0   D0  NaN
1   A1   B1   C1   D1  NaN
2   A2   B2   C2   D2  NaN
3   A3   B3   C3   D3  NaN
0   A4   B4   C4  NaN   E4
1   A5   B5   C5  NaN   E5
2   A6   B6   C6  NaN   E6
3   A7   B7   C7  NaN   E7
0   A8   B8   C8   D8  NaN
1   A9   B9   C9   D9  NaN
2  A10  B10  C10  D10  NaN
3  A11  B11  C11  D11  NaN

# Apply
untuk mengaplikasikan fungsi tertentu pada setiap baris di kolom tertentu

In [28]:
df=pd.DataFrame({
    'col1':[1,2,3],
    'col2':[111,222,333],
    'col3':'abc def ghi'.split()
})
df

   col1  col2 col3
0     1   111  abc
1     2   222  def
2     3   333  ghi

In [30]:
def times2(x):
    return x*2

df['col1'].apply(times2) #mengaplikasikan fungsi times2 terhadap col1
#setiap baris di kolom col1 dikalikan 2 oleh fungsi times2

0    2
1    4
2    6
Name: col1, dtype: int64

In [32]:
df[['col1','col2']].apply(times2) #bisa diaplikasikan ke lebih dari 1 kolom

   col1  col2
0     2   222
1     4   444
2     6   666

In [34]:
df['col1'].apply(lambda x:x*2) #bisa pakai lambda sebagai pengganti fungsi times2

0    2
1    4
2    6
Name: col1, dtype: int64

In [35]:
df['col1']*2 # untuk data numerik sudah ada fitur broadcasting, sehingga untuk transformasi sederhana, jarang pakai apply

0    2
1    4
2    6
Name: col1, dtype: int64

In [37]:
len(df['col3']) # yg didapat adalah jumlah baris di col3, padahal kita ingin melihat panjang karakter per baris

3

In [39]:
df['col3'].apply(len) # jumlah karakter per baris
#sama seperti .str.len()

0    3
1    3
2    3
Name: col3, dtype: int64

In [42]:
df['col3'].apply(lambda x:x[0]) # mengambil huruf pertama dari tiap baris di col3
# pemakaian apply memang banyak untuk pengolahan data string pada dataframe

0    a
1    d
2    g
Name: col3, dtype: object

In [46]:
contoh=pd.DataFrame({
    'Nama': 'Andi Budi Caca Dedi Elisa Fendi Gaga Haris Ikhsan Jessica'.split(),
    'Umur':[15,19,21,17,60,28,66,33,22,45]
})
contoh

      Nama  Umur
0     Andi    15
1     Budi    19
2     Caca    21
3     Dedi    17
4    Elisa    60
5    Fendi    28
6     Gaga    66
7    Haris    33
8   Ikhsan    22
9  Jessica    45

In [54]:
# pakai apply
# kalau di bawah 17 tahun, maka grup minor
# kalau di antara 17-55, maka dewasa
# kalau di atas 55, maka manula

In [55]:
contoh

      Nama  Umur    grup
0     Andi    15   minor
1     Budi    19  dewasa
2     Caca    21  dewasa
3     Dedi    17  dewasa
4    Elisa    60  manula
5    Fendi    28  dewasa
6     Gaga    66  manula
7    Haris    33  dewasa
8   Ikhsan    22  dewasa
9  Jessica    45  dewasa

In [67]:
contoh['Umur'].apply(lambda x: 'minor' if x<17 else 'dewasa' if x<56 else 'manula')

0     minor
1    dewasa
2    dewasa
3    dewasa
4    manula
5    dewasa
6    manula
7    dewasa
8    dewasa
9    dewasa
Name: Umur, dtype: object

# Pivot Table
tabel untuk merangkum aggregate data yg berjumlah besar

In [68]:
data=pd.DataFrame({
    'Kota':'Jakarta Jakarta Jakarta Surabaya Surabaya Surabaya'.split(),
    'Toko':'one two three one two three'.split(),
    'Manager':'Andi Budi Andi Budi Andi Budi'.split(),
    'Penjualan':[1,3,4,2,5,9]
})

In [69]:
data

       Kota   Toko Manager  Penjualan
0   Jakarta    one    Andi          1
1   Jakarta    two    Budi          3
2   Jakarta  three    Andi          4
3  Surabaya    one    Budi          2
4  Surabaya    two    Andi          5
5  Surabaya  three    Budi          9

In [70]:
data.pivot_table(values='Penjualan', index=['Kota','Toko'],columns='Manager') #mengubah bentuk data, tanpa mengubah isi data

Manager         Andi  Budi
Kota     Toko
Jakarta  one     1.0   NaN
         three   4.0   NaN
         two     NaN   3.0
Surabaya one     NaN   2.0
         three   NaN   9.0
         two     5.0   NaN

In [74]:
data.loc[6]=['Surabaya','one','Budi',4]
data #toko one di surabaya jadi ada 2, dengan manager sama-sama Budi

       Kota   Toko Manager  Penjualan
0   Jakarta    one    Andi          1
1   Jakarta    two    Budi          3
2   Jakarta  three    Andi          4
3  Surabaya    one    Budi          2
4  Surabaya    two    Andi          5
5  Surabaya  three    Budi          9
6  Surabaya    one    Budi          4

In [75]:
data.pivot_table(values='Penjualan', index=['Kota','Toko'],columns='Manager')
# dengan pivot tabel kita bisa melihat agregasi dari data yang memiliki index yang sama. 
# secara default, agregasi yang dipakai adalah rata-rata dari value yg ditentukan

Manager         Andi  Budi
Kota     Toko
Jakarta  one     1.0   NaN
         three   4.0   NaN
         two     NaN   3.0
Surabaya one     NaN   3.0
         three   NaN   9.0
         two     5.0   NaN

In [77]:
data.pivot_table(values='Penjualan', index=['Kota','Toko'],columns='Manager', aggfunc='sum')
# kita bisa mengubah agregasi yang dipakai dengan parameter aggfunc
# pada contoh ini kita memakai agregasi sum, sehingga nilai dari hasil pivot toko one di surabaya adalah 6 (2+4)

Manager         Andi  Budi
Kota     Toko
Jakarta  one     1.0   NaN
         three   4.0   NaN
         two     NaN   3.0
Surabaya one     NaN   6.0
         three   NaN   9.0
         two     5.0   NaN

# Data Input dan output

In [78]:
df= pd.DataFrame({
    'nama': 'Andi Budi Caca'.split(),
    'umur':[24, 18,20],
    'Pekerjaan':'Developer Pelajar Data-Scientist'.split()
})
df

   nama  umur       Pekerjaan
0  Andi    24       Developer
1  Budi    18         Pelajar
2  Caca    20  Data-Scientist

## CSV
comma separated value, file tipe text yang menggunakan tanda koma sebagai pemisah nilai

In [79]:
df.to_csv('contoh.csv') #untuk menyimpan dataframe menjadi file csv
# file akan tersimpan di folder di mana notebook kalian berada

In [80]:
pd.read_csv('contoh.csv') # tanpa index=False, index akan tersimpan sebagai kolom baru tanpa nama (Unnamed: 0)

   Unnamed: 0  nama  umur       Pekerjaan
0           0  Andi    24       Developer
1           1  Budi    18         Pelajar
2           2  Caca    20  Data-Scientist

In [81]:
df.to_csv('contoh.csv', index=False)

In [82]:
pd.read_csv('contoh.csv') #dengan index=False tidak ada kolom extra

   nama  umur       Pekerjaan
0  Andi    24       Developer
1  Budi    18         Pelajar
2  Caca    20  Data-Scientist

## Excel

In [83]:
df.to_excel('contoh.xlsx', sheet_name='halaman 1', index=False)

In [84]:
pd.read_excel('contoh.xlsx') #secara default akan membaca sheet pertama
# kalau mau membaca sheet yang lain, pakai parameter sheet_name

   nama  umur       Pekerjaan
0  Andi    24       Developer
1  Budi    18         Pelajar
2  Caca    20  Data-Scientist

## JSON
JavaScript Object Notation: format data teks ringan dari bahasa javascript  
Cara penulisan sangat mirip dengan dictionary pada python

In [85]:
df.to_json('contoh.json', orient='records') #orient: cara penulisan data di json, apakah per baris (records), atau cara lainnya

In [87]:
pd.read_json('contoh.json', orient='records')

   nama  umur       Pekerjaan
0  Andi    24       Developer
1  Budi    18         Pelajar
2  Caca    20  Data-Scientist

## HTML

In [93]:
pd.read_html('https://en.wikipedia.org/wiki/COVID-19_pandemic_deaths')[5]
#membaca SEMUA tabel di suatu halaman web
# indexing lagi untuk mencari tabel yang sesuai
# kalau kalian tertarik dengan materi webscrapping, bisa coba cek library beautifulsoup

     Unnamed: 0       Location    Jan 1    Feb 1
0           NaN          World  5437137  5670792
1           NaN  United States   819204   877924
2           NaN         Brazil   618984   626854
3           NaN          India   481486   496242
4           NaN         Russia   309707   332012
..          ...            ...      ...      ...
233         NaN        Tokelau        0        0
234         NaN          Tonga        0        0
235         NaN   Turkmenistan        0        0
236         NaN         Tuvalu        0        0
237         NaN        Vanuatu        0        0

[238 rows x 4 columns]